Core/src/Reports/ДЛ_УниверсальныйОтчет/ДЛ_УниверсальныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДЛ_УниверсальныйОтчет</name>
  <attributes>
    <name>ВидУниверсальногоОтчета</name>
    <type>
      <types>CatalogRef.ДЛ_ВидыУниверсальныхОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

Core/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаПР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаВР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеКорректироватьСтоимостьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Core/src/Enums/ДЛ_ТипыИсточниковДанныхСтатьи/ДЛ_ТипыИсточниковДанныхСтатьи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДЛ_ТипыИсточниковДанныхСтатьи</name>
  <enumValues>
    <name>Оборот</name>
  </enumValues>
  <enumValues>
    <name>ОборотДт</name>
  </enumValues>
  <enumValues>
    <name>ОборотКт</name>
  </enumValues>
  <enumValues>
    <name>ОстатокНачалоМесяца</name>
  </enumValues>
  <enumValues>
    <name>ОстатокДт</name>
  </enumValues>
  <enumValues>
    <name>ОстатокКт</name>
  </enumValues>
  <enumValues>
    <name>ОстатокКонецМесяца</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/ДЛ_ВидыУниверсальныхОтчетов/ДЛ_ВидыУниверсальныхОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДЛ_ВидыУниверсальныхОтчетов</name>
  <attributes>
    <name>ЦветФонаШапки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекстаШапки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ШрифтШапки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/Catalogs/ДЛ_СтатьиУниверсальногоОтчета/ДЛ_СтатьиУниверсальногоОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДЛ_СтатьиУниверсальногоОтчета</name>
  <owners>Catalog.ДЛ_ВидыУниверсальныхОтчетов</owners>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФормулы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФонаСтатьи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекстаСтатьи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ШрифтСтатьи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Источники</name>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипИсточника</name>
      <type>
        <types>EnumRef.ДЛ_ТипыИсточниковДанныхСтатьи</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Формулы</name>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Reports/ДЛ_УниверсальныйОтчет/Forms/ФормаОтчета/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Отчет.Период) Тогда
		
		Отчет.Период = Новый СтандартныйПериод;
		Отчет.Период.Вариант = ВариантСтандартногоПериода.ЭтотГод;
		
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Отчет.ВидУниверсальногоОтчета) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДЛ_ВидыУниверсальныхОтчетов.Ссылка
		|ИЗ
		|	Справочник.ДЛ_ВидыУниверсальныхОтчетов КАК ДЛ_ВидыУниверсальныхОтчетов";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Отчет.ВидУниверсальногоОтчета = Выборка.Ссылка;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(РазделительДробнойЧасти) Тогда 
		РазделительДробнойЧасти = ",";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РазделительГрупп) Тогда 
		РазделительГрупп = Символы.НПП;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Не ЗначениеЗаполнено(Отчет.ВидУниверсальногоОтчета) Тогда
		Сообщить(НСтр("ka='მიუთითეთ ფინანსური ანგარიშგების ტიპი!';ru='Укажите вид универсального отчета!'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчет.Период) Тогда
		Сообщить(НСтр("ka='მიუთითეთ პერიოდი ანგარიშგების ფორმირებისთვის!';ru='Укажите период формирования отчета!'"));
		Возврат;
	КонецЕсли; 
	
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПериодВЗависимостиОтВывода()
	
	ДатаНач = Отчет.Период.ДатаНачала;
	ДатаКон = Отчет.Период.ДатаОкончания;
	
	Если Вывод = 0 Тогда
		Отчет.Период.ДатаНачала = НачалоМесяца(ДатаНач);
		Отчет.Период.ДатаОкончания = КонецМесяца(ДатаКон);
	ИначеЕсли Вывод = 1 Тогда
		Отчет.Период.ДатаНачала = НачалоКвартала(ДатаНач);
		Отчет.Период.ДатаОкончания = КонецКвартала(ДатаКон);
	Иначе
		Отчет.Период.ДатаНачала = НачалоГода(ДатаНач);
		Отчет.Период.ДатаОкончания = КонецГода(ДатаКон);
	КонецЕсли;	
	
КонецПроцедуры // ИзменитьПериодВЗависимостиОтВывода()

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ИзменитьПериодВЗависимостиОтВывода();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводПриИзменении(Элемент)
	
	ИзменитьПериодВЗависимостиОтВывода();	
	
КонецПроцедуры

#КонецОбласти 

#Область ФормированиеОтчета

Процедура УстановитьОформлениеОбласти(Область, ЦветФона, ЦветТекста, Шрифт)
	
	Если Область = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если ЦветФона <> Неопределено Тогда
		Область.ТекущаяОбласть.ЦветФона = ЦветФона;
	КонецЕсли; 
	
	Если ЦветТекста <> Неопределено Тогда
		Область.ТекущаяОбласть.ЦветТекста = ЦветТекста;
	КонецЕсли; 
	
	Если Шрифт <> Неопределено Тогда
		Область.ТекущаяОбласть.Шрифт = Шрифт;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ВывестиПустуюСтроку(Макет, МассивПериодов, ЦветФона, ЦветТекста, Шрифт)
	
	ОбластьПустаяСтрокаКод = Макет.ПолучитьОбласть("ПустаяСтрока|Код");
	УстановитьОформлениеОбласти(ОбластьПустаяСтрокаКод, ЦветФона, ЦветТекста, Шрифт);
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрокаКод);
	
	ОбластьПустаяСтрокаСтатья = Макет.ПолучитьОбласть("ПустаяСтрока|Статья");
	УстановитьОформлениеОбласти(ОбластьПустаяСтрокаСтатья, ЦветФона, ЦветТекста, Шрифт);
	ТабличныйДокумент.Присоединить(ОбластьПустаяСтрокаСтатья);
	
	ОбластьПустаяСтрокаПериод = Макет.ПолучитьОбласть("ПустаяСтрока|Период");
	Для Каждого Период Из МассивПериодов Цикл
		
		УстановитьОформлениеОбласти(ОбластьПустаяСтрокаПериод, ЦветФона, ЦветТекста, Шрифт);
		ТабличныйДокумент.Присоединить(ОбластьПустаяСтрокаПериод);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьОтчет() Экспорт 
	
	_Отчет = РеквизитФормыВЗначение("Отчет");
	Макет = _Отчет.ПолучитьМакет("Макет");
	
	ТабличныйДокумент.Очистить();
	
	Если Вывод = 1 Тогда
		ВидПериода = "Квартал";
		Интервал = 3;
	ИначеЕсли Вывод = 2 Тогда
		ВидПериода = "Год";
		Интервал = 12;
	Иначе
		ВидПериода = "Месяц";
		Интервал = 1;
	КонецЕсли;
	
	НачалоПериода = НачалоМесяца(Отчет.Период.ДатаНачала);
	КонецПериода = НачалоМесяца(Отчет.Период.ДатаОкончания);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("КодСтатьи");
	ТаблицаДанных.Колонки.Добавить("Статья");
	ТаблицаДанных.Колонки.Добавить("ИдентификаторФормулы");
	
	МассивПериодов = Новый Массив;
	
	ТекущийМесяц = НачалоПериода;
	Пока ТекущийМесяц <= КонецПериода Цикл
		
		ТаблицаДанных.Колонки.Добавить("Период" + Формат(ТекущийМесяц, "ДФ=MMyyyy"), Новый ОписаниеТипов("Число"));
		МассивПериодов.Добавить(ТекущийМесяц);
		ТекущийМесяц = ДобавитьМесяц(ТекущийМесяц, Интервал);
		
	КонецЦикла;   
	
	Язык = ПользователиИнформационнойБазы.ТекущийПользователь().Язык;
	
	ТаблицаМесяцы = ПолучитьТаблицуМесяцовПериода(НачалоПериода, КонецПериода, ВидПериода); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидУниверсальногоОтчета"	, Отчет.ВидУниверсальногоОтчета);
	Запрос.УстановитьПараметр("КонецПериода"			, КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода"			, НачалоПериода);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ДЛ_СтатьиУниверсальногоОтчета.Ссылка КАК СтатьяУниверсальногоОтчета,
	|	ДЛ_СтатьиУниверсальногоОтчета.Код КАК КодСтатьи,
	|	ДЛ_СтатьиУниверсальногоОтчета.Наименование,
	|	ДЛ_СтатьиУниверсальногоОтчета.Порядок КАК Порядок,
	|	ДЛ_СтатьиУниверсальногоОтчета.ИдентификаторФормулы
	|ИЗ
	|	Справочник.ДЛ_СтатьиУниверсальногоОтчета КАК ДЛ_СтатьиУниверсальногоОтчета
	|ГДЕ
	|	ДЛ_СтатьиУниверсальногоОтчета.Владелец = &ВидУниверсальногоОтчета
	|	И НЕ ДЛ_СтатьиУниверсальногоОтчета.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЦветФонаШапки = Отчет.ВидУниверсальногоОтчета.ЦветФонаШапки.Получить();
	ЦветТекстаШапки = Отчет.ВидУниверсальногоОтчета.ЦветТекстаШапки.Получить();
	ШрифтШапки = Отчет.ВидУниверсальногоОтчета.ШрифтШапки.Получить();
	
	//ПодольскийАИ #УчетПоПроектам 09.11.2020 {
	//Добавление фильтра по проектам. Если указано несколько проектов, тогда для каждого проекта ормируем отдельную таблицу
	//Формирование таблицы вынесено в процедуру
	ПараметрыВывода = Новый Структура;
	ПараметрыВывода.Вставить("Макет", Макет);
	ПараметрыВывода.Вставить("РезультатЗапроса", РезультатЗапроса);
	ПараметрыВывода.Вставить("ТаблицаДанных", ТаблицаДанных);
	ПараметрыВывода.Вставить("ТаблицаМесяцы", ТаблицаМесяцы);
	ПараметрыВывода.Вставить("МассивПериодов", МассивПериодов);
	ПараметрыВывода.Вставить("Язык", Язык);
	ПараметрыВывода.Вставить("ЦветФонаШапки", ЦветФонаШапки);
	ПараметрыВывода.Вставить("ЦветТекстаШапки", ЦветТекстаШапки);
	ПараметрыВывода.Вставить("ШрифтШапки", ШрифтШапки);
	ПараметрыВывода.Вставить("Интервал", Интервал);
	ПараметрыВывода.Вставить("ВидПериода", ВидПериода);
	
	Если Проекты.Количество() > 1 Тогда
		Для Каждого ТекПроект Из Проекты Цикл
			
			ВывестиОбластьПроект(Макет, МассивПериодов, ТекПроект.Значение);
			ЗаполнитьИВывестиРезультатВТабличныйДокумент(ПараметрыВывода, ТекПроект.Значение);
			ВывестиПустуюСтрокуБезОформления(Макет, МассивПериодов);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ПараметрыВывода.ТаблицаДанных.Очистить();
		КонецЦикла;
	ИначеЕсли Проекты.Количество() = 1 Тогда
		ЗаполнитьИВывестиРезультатВТабличныйДокумент(ПараметрыВывода, Проекты[0].Значение);
	Иначе
		ЗаполнитьИВывестиРезультатВТабличныйДокумент(ПараметрыВывода);
	КонецЕсли;
	//ПодольскийАИ #УчетПоПроектам 09.11.2020 }
	
КонецПроцедуры // СформироватьОтчет()

//ПодольскийАИ #УчетПроектов 09.11.2020 {
Процедура ЗаполнитьИВывестиРезультатВТабличныйДокумент(ПараметрыВывода, Проект = Неопределено)

	ЦветФонаШапки = ПараметрыВывода.ЦветФонаШапки;
	ЦветТекстаШапки = ПараметрыВывода.ЦветТекстаШапки;
	ШрифтШапки = ПараметрыВывода.ШрифтШапки;
	МассивПериодов = ПараметрыВывода.МассивПериодов;
	РезультатЗапроса = ПараметрыВывода.РезультатЗапроса;
	ТаблицаДанных = ПараметрыВывода.ТаблицаДанных;
	Макет = ПараметрыВывода.Макет;
	Интервал = ПараметрыВывода.Интервал;
	ВидПериода = ПараметрыВывода.ВидПериода;
	
	НачалоПериода = НачалоМесяца(Отчет.Период.ДатаНачала);
	КонецПериода = НачалоМесяца(Отчет.Период.ДатаОкончания);
	
//ПодольскийАИ #УчетПроектов 09.11.2020 }

	ОбластьШапкаКод = Макет.ПолучитьОбласть("Шапка|Код");
	УстановитьОформлениеОбласти(ОбластьШапкаКод, ЦветФонаШапки, ЦветТекстаШапки, ШрифтШапки);
	ОбластьШапкаКод.Параметры.ВидУниверсальногоОтчета = Отчет.ВидУниверсальногоОтчета;
	ТабличныйДокумент.Вывести(ОбластьШапкаКод);
	
	ОбластьШапкаСтатья = Макет.ПолучитьОбласть("Шапка|Статья");
	УстановитьОформлениеОбласти(ОбластьШапкаСтатья, ЦветФонаШапки, ЦветТекстаШапки, ШрифтШапки);
	ТабличныйДокумент.Присоединить(ОбластьШапкаСтатья);
	
	ОбластьШапкаПериод = Макет.ПолучитьОбласть("Шапка|Период");
	Для Каждого Период Из МассивПериодов Цикл
		
		УстановитьОформлениеОбласти(ОбластьШапкаПериод, ЦветФонаШапки, ЦветТекстаШапки, ШрифтШапки);
		ТабличныйДокумент.Присоединить(ОбластьШапкаПериод);
		
	КонецЦикла;
	
	ВывестиПустуюСтроку(Макет, МассивПериодов, ЦветФонаШапки, ЦветТекстаШапки, ШрифтШапки);
	
	// Выводим шапку
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы|Код");
	УстановитьОформлениеОбласти(ОбластьШапкаТаблицы, ЦветФонаШапки, ЦветТекстаШапки, ШрифтШапки);
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы|Статья");
	УстановитьОформлениеОбласти(ОбластьШапкаТаблицы, ЦветФонаШапки, ЦветТекстаШапки, ШрифтШапки);
	ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицы);
	
	ОбластьШапкаТаблицыПериод = Макет.ПолучитьОбласть("ШапкаТаблицы|Период");
	Для Каждого Период Из МассивПериодов Цикл
		
		Если Интервал = 12 Тогда
			ОбластьШапкаТаблицыПериод.Параметры.Период = Формат(Период, "ДФ='yyyy'");
		ИначеЕсли Интервал = 3 Тогда	
			ОбластьШапкаТаблицыПериод.Параметры.Период = Формат(Период, "ДФ='к ''кв'' yyyy'");
		Иначе	
			//ОбластьШапкаТаблицыПериод.Параметры.Период = Формат(Период, "ДФ='MMMM yyyy'");
			Если ЯзыкВыводаМесяцев = "ka" Тогда 
				ОбластьШапкаТаблицыПериод.Параметры.Период = Формат(Период, "Л=ka_GE; ДФ='MMMM yyyy'");
			ИначеЕсли ЯзыкВыводаМесяцев = "ru" Тогда
				ОбластьШапкаТаблицыПериод.Параметры.Период = Формат(Период, "Л=ru_RU; ДФ='MMMM yyyy'");
			ИначеЕсли ЯзыкВыводаМесяцев = "en" Тогда
				ОбластьШапкаТаблицыПериод.Параметры.Период = Формат(Период, "Л=en_US; ДФ='MMMM yyyy'");
			Иначе
				ОбластьШапкаТаблицыПериод.Параметры.Период = Формат(Период, "ДФ='MMMM yyyy'");
			КонецЕсли;
		КонецЕсли; 
		
		УстановитьОформлениеОбласти(ОбластьШапкаТаблицыПериод, ЦветФонаШапки, ЦветТекстаШапки, ШрифтШапки);
		ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыПериод);
		
	КонецЦикла; 
	
	// Заполнить таблицу данных
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.КодСтатьи = Выборка.КодСтатьи;
		НоваяСтрока.Статья = Выборка.СтатьяУниверсальногоОтчета;
		НоваяСтрока.ИдентификаторФормулы = Выборка.ИдентификаторФормулы;
		
		//ПодольскийАИ #УчетПроектов 09.11.2020 {
		//Добавлен параметр Проект
		ТаблицаСуммПоПериодам = ПолучитьСуммуПоИсточнику(Выборка.СтатьяУниверсальногоОтчета, МассивПериодов, НачалоПериода, КонецПериода, ВидПериода, Проект);
		//ПодольскийАИ #УчетПроектов 09.11.2020 }
		Для Каждого Период из МассивПериодов Цикл
			
			СтрокаСуммаПоПериоду = ТаблицаСуммПоПериодам.Найти(Период, "Период");
			Если СтрокаСуммаПоПериоду <> Неопределено Тогда
				
				НоваяСтрока["Период" + Формат(Период, "ДФ=MMyyyy")] = СтрокаСуммаПоПериоду.Сумма;
				
			КонецЕсли; 
			
		КонецЦикла;               
		
	КонецЦикла;
	
	// Рассчитаем формулы
	Для каждого СтрокаДанных Из ТаблицаДанных Цикл
		
		Для каждого СтрокаФормула Из СтрокаДанных.Статья.Формулы Цикл
			
			
			Для каждого Период Из МассивПериодов Цикл
				
				РезультатФормулы = 0;
				
				Формула = СтрокаФормула.Формула;
				Результат = 0;
				
				Для каждого СтрокаИдентификатор Из ТаблицаДанных Цикл
					
					Формула = СтрЗаменить(Формула, "[" + СтрокаИдентификатор.ИдентификаторФормулы + "]", Формат(СтрокаИдентификатор["Период" + Формат(Период, "ДФ=MMyyyy")], "ЧРД=.; ЧН=0; ЧГ=0"));
					
				КонецЦикла; 
				
				Формула = "РезультатФормулы = " + Формула;
				
				Попытка
				
					Выполнить(Формула);
				
				Исключение
					
					Сообщить(ОписаниеОшибки());
					РезультатФормулы = 0;
				
				КонецПопытки; 
				
				
				СтрокаДанных["Период" + Формат(Период, "ДФ=MMyyyy")] = СтрокаДанных["Период" + Формат(Период, "ДФ=MMyyyy")] + РезультатФормулы;
				
			КонецЦикла; 
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	
	// Выведем данные
	ОбластьСтрокаТаблицыКод = Макет.ПолучитьОбласть("Строка|Код"); 
	ОбластьСтрокаТаблицыСтатья = Макет.ПолучитьОбласть("Строка|Статья"); 
	ОбластьСтрокаТаблицыПериод = Макет.ПолучитьОбласть("Строка|Период"); 
	Для каждого СтрокаДанных Из ТаблицаДанных Цикл
		
		Если СтрокаДанных.Статья.Скрыть Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		ЦветТекстаСтатьи = СтрокаДанных.Статья.ЦветТекстаСтатьи.Получить();
		ЦветФонаСтатьи = СтрокаДанных.Статья.ЦветФонаСтатьи.Получить();
		ШрифтСтатьи = СтрокаДанных.Статья.ШрифтСтатьи.Получить();
		
		УстановитьОформлениеОбласти(ОбластьСтрокаТаблицыКод, ЦветФонаСтатьи, ЦветТекстаСтатьи, ШрифтСтатьи);
		ОбластьСтрокаТаблицыКод.Параметры.Заполнить(СтрокаДанных);
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыКод);
		
		УстановитьОформлениеОбласти(ОбластьСтрокаТаблицыСтатья, ЦветФонаСтатьи, ЦветТекстаСтатьи, ШрифтСтатьи);
		ОбластьСтрокаТаблицыСтатья.Параметры.Заполнить(СтрокаДанных);
		ТабличныйДокумент.Присоединить(ОбластьСтрокаТаблицыСтатья);                                                      
		
		Для Каждого Период Из МассивПериодов Цикл
			
			УстановитьОформлениеОбласти(ОбластьСтрокаТаблицыПериод, ЦветФонаСтатьи, ЦветТекстаСтатьи, ШрифтСтатьи);
			//+++ Дмгг
			Сумма = СтрокаДанных["Период" + Формат(Период, "ДФ=MMyyyy")];
			ЦелаяЧастьЧисла = Цел(Сумма);
			ДробнаяЧастьЧисла = Сумма - Цел(Сумма);
			
			СуммаСтройкой = Формат(Сумма,"ЧДЦ="+Точность+"");
			
			ЦелаяЧастьСтрокий = Формат(ЦелаяЧастьЧисла,"");
			ДробнаяЧастьСтрокой = "";
			Если Точность <> 0 Тогда 
				ДробнаяЧастьСтрокой = Сред(Формат(ДробнаяЧастьЧисла,""), ?(ДробнаяЧастьЧисла<0, 4, 3), Точность);
			КонецЕсли;
			
			ЦелаяЧастьСтрокий = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(ЦелаяЧастьСтрокий,".",РазделительГрупп),",",РазделительГрупп)," ",РазделительГрупп),Символы.НПП,РазделительГрупп);
			СтрокаСуммыВывода = ЦелаяЧастьСтрокий + ?(ЗначениеЗаполнено(ДробнаяЧастьСтрокой), РазделительДробнойЧасти + ДробнаяЧастьСтрокой, "");
			//ОбластьСтрокаТаблицыПериод.Параметры.Сумма = СтрокаДанных["Период" + Формат(Период, "ДФ=MMyyyy")]; //+++ Дмгг
			ОбластьСтрокаТаблицыПериод.Параметры.Сумма = ?(Сумма=0, "", СтрокаСуммыВывода); 
			//--- Дмгг
			ТабличныйДокумент.Присоединить(ОбластьСтрокаТаблицыПериод);
			
		КонецЦикла; 
		
	КонецЦикла; 
	
//ПодольскийАИ #УчетПроектов 09.11.2020 }
КонецПроцедуры
//ПодольскийАИ #УчетПроектов 09.11.2020 }

//ПодольскийАИ #УчетПроектов 09.11.2020 {
Процедура ВывестиОбластьПроект(Макет, МассивПериодов, ТекПроект)
	
	ВывестиПустуюСтрокуБезОформления(Макет, МассивПериодов);
	
	ОбластьПроектКод = Макет.ПолучитьОбласть("Проекты|Код");
	ОбластьПроектКод.Параметры.Проект = Строка(ТекПроект);
	ТабличныйДокумент.Вывести(ОбластьПроектКод);
	
	ОбластьПроектСтатья = Макет.ПолучитьОбласть("Проекты|Статья");
	ТабличныйДокумент.Присоединить(ОбластьПроектСтатья);
	
	ОбластьПроектПериод = Макет.ПолучитьОбласть("Проекты|Период");
	Для Каждого Период Из МассивПериодов Цикл
		ТабличныйДокумент.Присоединить(ОбластьПроектПериод);
	КонецЦикла;
	
	ВывестиПустуюСтрокуБезОформления(Макет, МассивПериодов);
	
КонецПроцедуры

Процедура ВывестиПустуюСтрокуБезОформления(Макет, МассивПериодов);
	
	ОбластьПустаяСтрокаКод = Макет.ПолучитьОбласть("ПустаяСтрока|Код");
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрокаКод);
	
	ОбластьПустаяСтрокаСтатья = Макет.ПолучитьОбласть("ПустаяСтрока|Статья");
	ТабличныйДокумент.Присоединить(ОбластьПустаяСтрокаСтатья);
	
	ОбластьПустаяСтрокаПериод = Макет.ПолучитьОбласть("ПустаяСтрока|Период");
	Для Каждого Период Из МассивПериодов Цикл
		ТабличныйДокумент.Присоединить(ОбластьПустаяСтрокаПериод);
	КонецЦикла;
	
КонецПроцедуры

//ПодольскийАИ #УчетПроектов 09.11.2020 }

&НаСервереБезКонтекста
Функция ПолучитьСуммуПоИсточнику(Статья, МассивПериодов, НачалоПериода, КонецПериода, ВидПериода, Проект = Неопределено)
	
	ТаблицаДанныхПоПериодам = Новый ТаблицаЗначений;
	ТаблицаДанныхПоПериодам.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ТаблицаДанныхПоПериодам.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	
	Для каждого Источник Из Статья.Источники Цикл
		
		//ПодольскийАИ #УчетПроектов 09.11.2020 {
		ПараметрыПроекта = ПолучитьПараметрыПроектаСчета(Источник.СчетУчета, Проект);
		//ПодольскийАИ #УчетПроектов 09.11.2020 }
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СчетУчета", Источник.СчетУчета);
		//Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(НачалоПериода));
		//Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(КонецПериода));
		// Kuzmich, 18.05.2019, ошибки в финансовых отчетах
		Если (ВидПериода = "Год")ИЛИ(ВидПериода = "წელი") Тогда
			Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(НачалоПериода));
			Запрос.УстановитьПараметр("КонецПериода", КонецГода(КонецПериода));
		ИначеЕсли (ВидПериода = "Квартал")ИЛИ(ВидПериода = "კვარტალი") Тогда
			Запрос.УстановитьПараметр("НачалоПериода", НачалоКвартала(НачалоПериода));
			Запрос.УстановитьПараметр("КонецПериода", КонецКвартала(КонецПериода));
		Иначе	
			Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(НачалоПериода));
			Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(КонецПериода));
		КонецЕсли;
		// Kuzmich, 18.05.2019, ошибки в финансовых отчетах
		
		Если Источник.ТипИсточника = Перечисления.ДЛ_ТипыИсточниковДанныхСтатьи.ОборотДт
			ИЛИ Источник.ТипИсточника = Перечисления.ДЛ_ТипыИсточниковДанныхСтатьи.ОборотКт
			ИЛИ Источник.ТипИсточника = Перечисления.ДЛ_ТипыИсточниковДанныхСтатьи.Оборот Тогда
			
			//ПодольскийАИ #УчетПроектов 09.11.2020 {
			//В текст запроса добавлен маркер для обора по проектам
			//ПодольскийАИ #УчетПроектов 09.11.2020 }
			Запрос.Текст = "ВЫБРАТЬ
			               |	ХозрасчетныйОбороты.Период,
			               |	ХозрасчетныйОбороты.СуммаОборот,
			               |	ХозрасчетныйОбороты.СуммаОборотДт,
			               |	ХозрасчетныйОбороты.СуммаОборотКт
			               |ИЗ
			               |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Секунда, Счет = &СчетУчета, , {ОтборПроект}, , ) КАК ХозрасчетныйОбороты";
			//ПодольскийАИ #УчетПроектов 09.11.2020 {
			Если ПараметрыПроекта.ЕстьПроект Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ОтборПроект}", ПараметрыПроекта.СубконтоПроект + " = &" + ПараметрыПроекта.СубконтоПроект);
				Запрос.УстановитьПараметр(ПараметрыПроекта.СубконтоПроект, Проект);
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ОтборПроект}", "");
			КонецЕсли;
			//ПодольскийАИ #УчетПроектов 09.11.2020 }
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Секунда", ВидПериода);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = ТаблицаДанныхПоПериодам.Добавить();
				НоваяСтрока.Период = Выборка.Период;
				Если Источник.ТипИсточника = Перечисления.ДЛ_ТипыИсточниковДанныхСтатьи.Оборот Тогда
					
					НоваяСтрока.Сумма = Выборка.СуммаОборот;
					
				ИначеЕсли Источник.ТипИсточника = Перечисления.ДЛ_ТипыИсточниковДанныхСтатьи.ОборотДт Тогда	
					
					НоваяСтрока.Сумма = Выборка.СуммаОборотДт;
					
				ИначеЕсли Источник.ТипИсточника = Перечисления.ДЛ_ТипыИсточниковДанныхСтатьи.ОборотКт Тогда		
					
					НоваяСтрока.Сумма = Выборка.СуммаОборотКт;
					
				КонецЕсли; 
				
				НоваяСтрока.Сумма = НоваяСтрока.Сумма * Источник.Коэффициент;
				
			КонецЦикла; 
			
		ИначеЕсли Источник.ТипИсточника = Перечисления.ДЛ_ТипыИсточниковДанныхСтатьи.ОстатокНачалоМесяца Тогда
			
			Для Каждого Период Из МассивПериодов Цикл
				
				НоваяСтрока = ТаблицаДанныхПоПериодам.Добавить();
				НоваяСтрока.Период = Период;
				
				//ПодольскийАИ #УчетПроектов 09.11.2020 {
				//В текст запроса добавлен маркер для обора по проектам
				//ПодольскийАИ #УчетПроектов 09.11.2020 }
				Запрос.УстановитьПараметр("Период", НачалоМесяца(Период));
				Запрос.Текст = "ВЫБРАТЬ
				               |	ХозрасчетныйОстатки.СуммаОстаток,
				               |	ХозрасчетныйОстатки.СуммаОстатокДт,
				               |	ХозрасчетныйОстатки.СуммаОстатокКт
				               |ИЗ
				               |	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет = &СчетУчета, , {ОтборПроект}) КАК ХозрасчетныйОстатки";
				//ПодольскийАИ #УчетПроектов 09.11.2020 {
				Если ПараметрыПроекта.ЕстьПроект Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ОтборПроект}", ПараметрыПроекта.СубконтоПроект + " = &" + ПараметрыПроекта.СубконтоПроект);
					Запрос.УстановитьПараметр(ПараметрыПроекта.СубконтоПроект, Проект);
				Иначе
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ОтборПроект}", "");
				КонецЕсли;
				//ПодольскийАИ #УчетПроектов 09.11.2020 }
			
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					
					НоваяСтрока.Сумма = Выборка.СуммаОстаток;
					
				КонецЕсли;
				
				НоваяСтрока.Сумма = НоваяСтрока.Сумма * Источник.Коэффициент;
				
			КонецЦикла; 
			
		ИначеЕсли Источник.ТипИсточника = Перечисления.ДЛ_ТипыИсточниковДанныхСтатьи.ОстатокКонецМесяца Тогда
			
			Для Каждого Период Из МассивПериодов Цикл
				
				НоваяСтрока = ТаблицаДанныхПоПериодам.Добавить();
				НоваяСтрока.Период = Период;
				
				Запрос.УстановитьПараметр("Период", Новый Граница(КонецМесяца(Период), ВидГраницы.Включая));
				//ПодольскийАИ #УчетПроектов 09.11.2020 {
				//В текст запроса добавлен маркер для обора по проектам
				//ПодольскийАИ #УчетПроектов 09.11.2020 }
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ХозрасчетныйОстатки.СуммаОстаток,
				|	ХозрасчетныйОстатки.СуммаОстатокДт,
				|	ХозрасчетныйОстатки.СуммаОстатокКт
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет = &СчетУчета, , {ОтборПроект}) КАК ХозрасчетныйОстатки";
				//ПодольскийАИ #УчетПроектов 09.11.2020 {
				Если ПараметрыПроекта.ЕстьПроект Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ОтборПроект}", ПараметрыПроекта.СубконтоПроект + " = &" + ПараметрыПроекта.СубконтоПроект);
					Запрос.УстановитьПараметр(ПараметрыПроекта.СубконтоПроект, Проект);
				Иначе
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ОтборПроект}", "");
				КонецЕсли;
				//ПодольскийАИ #УчетПроектов 09.11.2020 }
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					
					НоваяСтрока.Сумма = Выборка.СуммаОстаток;
					
				КонецЕсли;
				
				НоваяСтрока.Сумма = НоваяСтрока.Сумма * Источник.Коэффициент;
				
			КонецЦикла; 
			
		ИначеЕсли Источник.ТипИсточника = Перечисления.ДЛ_ТипыИсточниковДанныхСтатьи.ОстатокДт Тогда
			
			Для Каждого Период Из МассивПериодов Цикл
				
				НоваяСтрока = ТаблицаДанныхПоПериодам.Добавить();
				НоваяСтрока.Период = Период;
				
				//Запрос.УстановитьПараметр("Период", Новый Граница(КонецМесяца(Период), ВидГраницы.Включая));
				// Kuzmich, 18.05.2019, ошибки в финансовых отчетах
				Если (ВидПериода = "Год")ИЛИ(ВидПериода = "წელი") Тогда
					Запрос.УстановитьПараметр("Период", Новый Граница(КонецГода(Период), ВидГраницы.Включая));
				ИначеЕсли (ВидПериода = "Квартал")ИЛИ(ВидПериода = "კვარტალი") Тогда
					Запрос.УстановитьПараметр("Период", Новый Граница(КонецКвартала(Период), ВидГраницы.Включая));
				Иначе	
					Запрос.УстановитьПараметр("Период", Новый Граница(КонецМесяца(Период), ВидГраницы.Включая));
				КонецЕсли;
				// Kuzmich, 18.05.2019, ошибки в финансовых отчетах
				
				//ПодольскийАИ #УчетПроектов 09.11.2020 {
				//В текст запроса добавлен маркер для обора по проектам
				//ПодольскийАИ #УчетПроектов 09.11.2020 }
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ХозрасчетныйОстатки.СуммаОстаток,
				|	ХозрасчетныйОстатки.СуммаОстатокДт,
				|	ХозрасчетныйОстатки.СуммаОстатокКт
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет = &СчетУчета, , {ОтборПроект}) КАК ХозрасчетныйОстатки";
				//ПодольскийАИ #УчетПроектов 09.11.2020 {
				Если ПараметрыПроекта.ЕстьПроект Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ОтборПроект}", ПараметрыПроекта.СубконтоПроект + " = &" + ПараметрыПроекта.СубконтоПроект);
					Запрос.УстановитьПараметр(ПараметрыПроекта.СубконтоПроект, Проект);
				Иначе
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ОтборПроект}", "");
				КонецЕсли;
				//ПодольскийАИ #УчетПроектов 09.11.2020 }
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					
					НоваяСтрока.Сумма = Выборка.СуммаОстатокДт;
					
				КонецЕсли;
				
				НоваяСтрока.Сумма = НоваяСтрока.Сумма * Источник.Коэффициент;
				
			КонецЦикла; 
			
		ИначеЕсли Источник.ТипИсточника = Перечисления.ДЛ_ТипыИсточниковДанныхСтатьи.ОстатокКт Тогда
			
			Для Каждого Период Из МассивПериодов Цикл
				
				НоваяСтрока = ТаблицаДанныхПоПериодам.Добавить();
				НоваяСтрока.Период = Период;
				
				//Запрос.УстановитьПараметр("Период", Новый Граница(КонецМесяца(Период), ВидГраницы.Включая));
				// Kuzmich, 18.05.2019, ошибки в финансовых отчетах
				Если (ВидПериода = "Год")ИЛИ(ВидПериода = "წელი") Тогда
					Запрос.УстановитьПараметр("Период", Новый Граница(КонецГода(Период), ВидГраницы.Включая));
				ИначеЕсли (ВидПериода = "Квартал")ИЛИ(ВидПериода = "კვარტალი") Тогда
					Запрос.УстановитьПараметр("Период", Новый Граница(КонецКвартала(Период), ВидГраницы.Включая));
				Иначе	
					Запрос.УстановитьПараметр("Период", Новый Граница(КонецМесяца(Период), ВидГраницы.Включая));
				КонецЕсли;
				// Kuzmich, 18.05.2019, ошибки в финансовых отчетах
				
				//ПодольскийАИ #УчетПроектов 09.11.2020 {
				//В текст запроса добавлен маркер для обора по проектам
				//ПодольскийАИ #УчетПроектов 09.11.2020 }
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ХозрасчетныйОстатки.СуммаОстаток,
				|	ХозрасчетныйОстатки.СуммаОстатокДт,
				|	ХозрасчетныйОстатки.СуммаОстатокКт
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет = &СчетУчета, , {ОтборПроект}) КАК ХозрасчетныйОстатки";
				//ПодольскийАИ #УчетПроектов 09.11.2020 {
				Если ПараметрыПроекта.ЕстьПроект Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ОтборПроект}", ПараметрыПроекта.СубконтоПроект + " = &" + ПараметрыПроекта.СубконтоПроект);
					Запрос.УстановитьПараметр(ПараметрыПроекта.СубконтоПроект, Проект);
				Иначе
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ОтборПроект}", "");
				КонецЕсли;
				//ПодольскийАИ #УчетПроектов 09.11.2020 }
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					
					НоваяСтрока.Сумма = Выборка.СуммаОстатокКт;
					
				КонецЕсли;
				
				НоваяСтрока.Сумма = НоваяСтрока.Сумма * Источник.Коэффициент;
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ТаблицаДанныхПоПериодам.Свернуть("Период", "Сумма");
	Возврат ТаблицаДанныхПоПериодам;	
	
КонецФункции // ()

//ПодольскийАИ #УчетПроектов 09.11.2020 {
&НаСервереБезКонтекста
Функция ПолучитьПараметрыПроектаСчета(СчетУчета, Проект = Неопределено)
	
	ПараметрыПроекта = Новый Структура("ЕстьПроект,СубконтоПроект", Ложь, "");
	Если Проект = Неопределено Тогда
		Возврат ПараметрыПроекта;
	КонецЕсли;
	
	СубконтоПроект = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты;
	
	Для Каждого СтрокаСубконто Из СчетУчета.ВидыСубконто Цикл
		Если СубконтоПроект = СтрокаСубконто.ВидСубконто Тогда
			ПараметрыПроекта.ЕстьПроект = Истина;
			ПараметрыПроекта.СубконтоПроект = "Субконто" + Строка(СтрокаСубконто.НомерСтроки);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПараметрыПроекта;
	
КонецФункции
//ПодольскийАИ #УчетПроектов 09.11.2020 }

#КонецОбласти 

#Область ФункцииОбщегоНазначения

Функция ПолучитьТаблицуМесяцовПериода(НачалоПериода, КонецПериода, ВидПериода)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Месяц", Новый ОписаниеТипов("Дата"));
	
	Если ВидПериода = 1 Тогда
		РасМесяц = НачалоКвартала(НачалоПериода);
		ПериодДо = НачалоКвартала(КонецПериода);
		П = 3;
	ИначеЕсли ВидПериода = 2 Тогда
		РасМесяц = НачалоГода(НачалоПериода);
		ПериодДо = НачалоГода(КонецПериода);
		П = 12;
	Иначе 
		РасМесяц = НачалоМесяца(НачалоПериода);
		ПериодДо = НачалоМесяца(КонецПериода);
		П = 1;
	КонецЕсли;
	
	Пока РасМесяц <= ПериодДо Цикл
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Месяц = РасМесяц;
		РасМесяц = ДобавитьМесяц(РасМесяц, П);
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции // ПолучитьТаблицуМесяцовПериода()

Функция РасчичатьГруппировкуПоФормуле(Таблица, Выборка)
	
	СтруктураПараметров = Новый Структура;	
	СтруктураПараметров.Вставить("Группировка"		, Выборка.СтатьяУниверсальногоОтчета);
	СтруктураПараметров.Вставить("СуммаГруппировки"	, 0);
	СуммаГруппировки = 0;
	
	Формула = Выборка.Формула;
	
	Если Не ЗначениеЗаполнено(Выборка.Формула) Или Таблица.Количество() = 0 Тогда
		Возврат СтруктураПараметров;
	КонецЕсли;
	
	МассивСтрокТаблицыПоМесяцу = Таблица.НайтиСтроки(Новый Структура("Месяц", Выборка.Месяц));
	
	Для Каждого СтрМас Из МассивСтрокТаблицыПоМесяцу Цикл
		Если Найти(Формула, СокрЛП(СтрМас.ИдентификаторФормулы)) <> 0 Тогда
			Формула = СтрЗаменить(Формула, "[" + СокрЛП(СтрМас.ИдентификаторФормулы) + "]", Строка(СтрМас.СуммаОборот)); 	
		КонецЕсли;
	КонецЦикла;
	
	Формула = СтрЗаменить(Формула, ",", ".");
	Формула = СтрЗаменить(Формула, " ", "");
	
	Попытка
		СтруктураПараметров.СуммаГруппировки = Вычислить(Формула); 
	Исключение
		Сообщить(НСтр("ka='არასწორად არის მითითებული ფორმულა დაჯგუფებაში: ""';ru='Не корректно указана формула в группировке: ""'") + Выборка.СтатьяУниверсальногоОтчета + """.");
		Возврат СтруктураПараметров;
	КонецПопытки;
	
	Возврат СтруктураПараметров;
	
КонецФункции // РасчичатьГруппировкуПоФормуле()

Функция ОпределитьФорматДаты(Период, ВидПериода, Язык)
	
	КодЯзыка = Язык.КодЯзыка;
	
	Если ВидПериода = 1 Тогда
		ПериодСФорматом = ОпределитьКвартал(Период, КодЯзыка);
	ИначеЕсли ВидПериода = 2 Тогда
		ПериодСФорматом = Строка(Год(Период));
	Иначе	
		ПериодСФорматом = формат(Период,"Л=" + КодЯзыка + "; ДФ=ММММ");
	КонецЕсли;
	
	ПериодСФорматом	= СтрЗаменить(ПериодСФорматом, " ", "");
	
	Возврат ПериодСФорматом;
	
КонецФункции // ОпределитьФорматДаты()

Функция ОпределитьКвартал(Дата, КодЯзыка)
	
	Если КодЯзыка = "ka" Тогда
		ПредставлениеКвартала = "კვარტალი";
	Иначе
		ПредставлениеКвартала = "Квартал";
	КонецЕсли;
	
	Если Месяц(Дата) = 1 Тогда
		Квартал = ПредставлениеКвартала + " I (" + Строка(Год(Дата)) + ")";
	ИначеЕсли Месяц(Дата) = 4 Тогда
		Квартал = ПредставлениеКвартала + " II (" + Строка(Год(Дата)) + ")";
	ИначеЕсли Месяц(Дата) = 7 Тогда
		Квартал = ПредставлениеКвартала + " III (" + Строка(Год(Дата)) + ")";
	ИначеЕсли Месяц(Дата) = 10 Тогда
		Квартал = ПредставлениеКвартала + " IV(" + Строка(Год(Дата)) + ")";
	КонецЕсли;
	
	Возврат Квартал;
	
КонецФункции // ОпределитьКвартал()

#КонецОбласти
